systems/centos/networking/firewalld.org
#+title: firewalld
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

* binaries

- =/usr/bin/firewall-cmd=
- =/usr/bin/firewall-config= ; gui

* configuration

- =/etc/firewalld/services/= ; this is a directory. system/user config.
- =/usr/lib/firewalld/services/= ; default. updates will overwrite changes made here.

* commands

- systemctl status firewalld ; check current status
- systemctl start firewalld ; start if not started
- systemctl enable firewalld ; create symlinks to allow start at boot
- systemctl restart firewalld ; reload rules
- systemctl stop firewalld
- systemctl disable firewalld

notes: 
- start and enable are orthogonal.
- status will show the vendor preset, enabled and active.

- firewall-cmd --list-all
- firewall-cmd --get-zones
- firewall-cmd --get-services
- firewall-cmd --get-default-zone
- firewall-cmd --permanent --add-service=ftp
- firewall-cmd --reload

[[file:../centos.html][back]]

